In [ ]:
# %pip install numpy pandas sqlalchemy

In [1]:
import numpy as np
import pandas as pd

# Reorganizing Data in DataFrames

## Concatenation / Appends

The `pd.concat()` fucntion and `DataFrame.append()` method takes DataFrames with identical columns and makes a DataFrame that is **taller** than either of them by stacking them on top of each other.

For example, it can turn this `df1` DataFrame:

| Day | Weather |
| :-: | :---:   |
| Monday | Sunny   |
| Tuesday | Rainy |

and this `df2` DataFrame:

| Day | Weather |
| :-: | :---:   |
| Wednesday | Sunny   |
| Thursday | Rainy |

into this:

| Day | Weather |
| :-: | :---:   |
| Monday | Sunny   |
| Tuesday | Rainy |
| Wednesday | Sunny   |
| Thursday | Rainy |


with one line of code:

```python
pd.concat([df1, df2])
```

**Note:** If you'd like pandas to ignore the index of the dataframes when appending them, the following option is helpful:

```python
pd.concat([df1, df2], ignore_index=True)
```

**Note:** With the `pd.concat()` function, you can concatenate as many dataframes in one step as you want!

#### Exercise

Let's practice concatenating DataFrames with the `pd.concat` function:

In [2]:
df1 = pd.DataFrame({'Name': ['Jackson', 'Josh', 'Jenny'], 'Age': [16, 19, 17]})
df1

      Name  Age
0  Jackson   16
1     Josh   19
2    Jenny   17

In [3]:
df2 = pd.DataFrame({'Name': ['Jess', 'Jon', 'Joe'], 'Age': [21, 16, 23]}, index=[3, 4, 5])
df2

   Name  Age
3  Jess   21
4   Jon   16
5   Joe   23

In [4]:
df3 = pd.DataFrame({'Name': ['Jill', 'Josephine', 'Jack'], 'Age': [5, 10, 61]})
df3

        Name  Age
0       Jill    5
1  Josephine   10
2       Jack   61

Concatenate df1 and df2 together!

In [5]:
pd.concat([df1, df2])

      Name  Age
0  Jackson   16
1     Josh   19
2    Jenny   17
3     Jess   21
4      Jon   16
5      Joe   23

Concatenate df2 and df3 together!

In [6]:
pd.concat([df2, df3])

        Name  Age
3       Jess   21
4        Jon   16
5        Joe   23
0       Jill    5
1  Josephine   10
2       Jack   61

Concatenate all three dataframes in a single line

In [7]:
pd.concat([df1, df2, df3])

        Name  Age
0    Jackson   16
1       Josh   19
2      Jenny   17
3       Jess   21
4        Jon   16
5        Joe   23
0       Jill    5
1  Josephine   10
2       Jack   61

The index in these datasets is unlabelled, indicating that they potentially don't contain useful data.  Concatenate them all together so that the index of the final dataframe is simply 0-8.

In [8]:
pd.concat([df1, df2, df3], ignore_index=True)

        Name  Age
0    Jackson   16
1       Josh   19
2      Jenny   17
3       Jess   21
4        Jon   16
5        Joe   23
6       Jill    5
7  Josephine   10
8       Jack   61

## Merge / Joins
The `pd.merge()` function and `DataFrame.join()` method take two DataFrames and make them **wider** by matching rows with the same values on a specified column.  

For example, it can turn this `df1` DataFrame:

| Day | Weather |
| :-: | :---:   |
| Monday | Sunny   |
| Tuesday | Rainy |

and this `df2` DataFrame:

| Day | Temperature |
| :-: | :---:   |
| Tuesday | 12   |
| Monday | 18 |

into this:

| Day | Weather | Temperature |
| :-: | :---:   | :---: |
| Monday | Sunny   | 18 |
| Tuesday | Rainy | 12 |

with one line of code:

```python
df_merged = pd.merge(left=df1, right=df2, left_on="Day", right_on="Day")
```

Just specify which columns should be matched up with each other, and it will search for the matching values automatically!  If you want it to use the index, you can alternatively supply the option `left_index=True` and/or `right_index=True`.

### Exercises

Let's practice merging dataframes with the `pd.merge()` function.

Dataframe 1:

In [11]:
df1 = pd.DataFrame({'Name': ['Paul', 'Arash', 'Jenny'], 'Age': [16, 19, 17]})
df1

    Name  Age
0   Paul   16
1  Arash   19
2  Jenny   17

Dataframe 2:

In [12]:
df2 = pd.DataFrame({'Name': ['Arash', 'Paul', 'Sara'], 'Weight': [32, 15, 37]})
df2

    Name  Weight
0  Arash      32
1   Paul      15
2   Sara      37

Dataframe 3:

In [13]:
df3 = pd.DataFrame({'Name': ['Amy', 'Paul', 'Sara'], 'Height': [170, 190, 143]})
df3

   Name  Height
0   Amy     170
1  Paul     190
2  Sara     143

Merge the first two dataframes together.  Who do we know both the age and weight of?

In [15]:
pd.merge(left = df1, right = df2, left_on = 'Name', right_on='Name')

    Name  Age  Weight
0   Paul   16      15
1  Arash   19      32

Try merging all 3 by merging twice.  Who do we know everything about?

In [17]:
df_merge1 = pd.merge(left = df1, right = df2, left_on = 'Name', right_on='Name')
df = pd.merge(left=df_merge1, right = df3, left_on = 'Name', right_on = 'Name')
df

   Name  Age  Weight  Height
0  Paul   16      15     190

Note that the Names that weren't present in both dataframes dropped out of the final result.  If you'd like to keep them and have NaNs appear, you can change the `how` parameter in the `pd.merge()` function.  Let's try out a few options by merging dataframes 1 and 2:

`how="outer"`

In [18]:
pd.merge(left = df1, right = df2, left_on = 'Name', right_on = 'Name', how = "outer")

    Name   Age  Weight
0  Arash  19.0    32.0
1  Jenny  17.0     NaN
2   Paul  16.0    15.0
3   Sara   NaN    37.0

`how="left"`

In [19]:
pd.merge(left = df1, right = df2, left_on = 'Name', right_on = 'Name', how = "left")

    Name  Age  Weight
0   Paul   16    15.0
1  Arash   19    32.0
2  Jenny   17     NaN

`how="right"`

In [20]:
pd.merge(left = df1, right = df2, left_on = 'Name', right_on = 'Name', how = "right")

    Name   Age  Weight
0  Arash  19.0      32
1   Paul  16.0      15
2   Sara   NaN      37

`how="inner"`

In [21]:
pd.merge(left = df1, right = df2, left_on = 'Name', right_on = 'Name', how = "inner")

    Name  Age  Weight
0   Paul   16      15
1  Arash   19      32

Recognizing that multiple inner joins can result in high data attrition, what policies would you put in your future data analyses to both prevent data loss and keep data easy to analyze?

## Melts

The `pd.melt()` function and `DataFrame.melt()` method take a single dataframe and make it **taller** by taking data stored in column names and putting it into the rows along with the rest of the data, adding extra metadata in the process.

For example, it can turn this `df` DataFrame:

| Month | Year | Monday | Tuesday | Wednesday |
| :--:  | :--: | :--:   | :--:    | :--:      |
| January | 2021 | 0 | -2 | -1 |
| February | 2021 | 2 | 4 | -2 |

into this:

| Month | Year | Weekday | Temperature |
| :--:  | :--: | :--:    |  :--:       |
| January | 2021 | Monday | 0 |
| January | 2021 | Tuesday | -2 |
| January | 2021 | Wednesday | -1 |
| February | 2021 | Monday | 2 |
| February | 2021 | Tuesday | 4 | 
| February | 2021 | Wednesday | -2 |

with one line of code:

```python
pd.melt(
    df, 
    id_vars=['Month', 'Year'],  # The columns that should stay the same
    value_vars=['Monday', 'Tuesday', 'Wednesday'],   # The columns that should melt
    var_name='Weekday',  # The new Column that will represent the melted column name's variable
    value_name='Temperature'  # The new Column that the data represents
)
```

**Note**: Melting a dataframe also called *"tidying"* data, making a *"long"* dataframe from a *"wide"* dataframe, or building a *design matrix*

#### Exercises

Let's practice tidying dataframes with the `pd.melt()` function.

In [23]:
df = (
    pd.read_csv('https://raw.githubusercontent.com/nickdelgrosso/CodeTeachingMaterials/main/datasets/worldbankdata.csv')
    .get(['Country Name', 'Country Code', '1960', '1970', '1980', '1990', '2000'])
    .sample(10)
    .reset_index(drop=True)
)
df.head()

  Country Name Country Code   1960   1970   1980   1990   2000
0      Burundi          BDI  6.953  7.311  7.450  7.542  7.057
1   San Marino          SMR    NaN    NaN    NaN    NaN    NaN
2  Yemen, Rep.          YEM  7.292  7.542  8.993  8.667  6.363
3      Jamaica          JAM  5.419  5.477  3.733  2.948  2.603
4     Dominica          DMA    NaN    NaN    NaN    NaN    NaN

Melt this dataset so it has four columns: "Country Name", "Country Code", "Year", and "Fertility Rate"

In [25]:
pd.melt(df,
        id_vars = ['Country Name', 'Country Code'],
        value_vars = ['1960', '1970', '1980', '1990', '2000'],
        var_name='Decade',
        value_name='Birth Rate',
        )

     Country Name Country Code Decade  Birth Rate
0         Burundi          BDI   1960       6.953
1      San Marino          SMR   1960         NaN
2     Yemen, Rep.          YEM   1960       7.292
3         Jamaica          JAM   1960       5.419
4        Dominica          DMA   1960         NaN
5   Venezuela, RB          VEN   1960       6.616
6          Cyprus          CYP   1960       3.500
7          Turkey          TUR   1960       6.303
8   Guinea-Bissau          GNB   1960       5.828
9        Colombia          COL   1960       6.807
10        Burundi          BDI   1970       7.311
11     San Marino          SMR   1970         NaN
12    Yemen, Rep.          YEM   1970       7.542
13        Jamaica          JAM   1970       5.477
14       Dominica          DMA   1970         NaN
15  Venezuela, RB          VEN   1970       5.404
16         Cyprus          CYP   1970       2.610
17         Turkey          TUR   1970       5.563
18  Guinea-Bissau          GNB   1970       6.071
19       Colombia          COL   1970       5.599
20        Burundi          BDI   1980       7.450
21     San Marino          SMR   1980         NaN
22    Yemen, Rep.          YEM   1980       8.993
23        Jamaica          JAM   1980       3.733
24       Dominica          DMA   1980         NaN
25  Venezuela, RB          VEN   1980       4.199
26         Cyprus          CYP   1980       2.354
27         Turkey          TUR   1980       4.361
28  Guinea-Bissau          GNB   1980       6.322
29       Colombia          COL   1980       3.993
30        Burundi          BDI   1990       7.542
31     San Marino          SMR   1990         NaN
32    Yemen, Rep.          YEM   1990       8.667
33        Jamaica          JAM   1990       2.948
34       Dominica          DMA   1990         NaN
35  Venezuela, RB          VEN   1990       3.448
36         Cyprus          CYP   1990       2.411
37         Turkey          TUR   1990       3.078
38  Guinea-Bissau          GNB   1990       6.649
39       Colombia          COL   1990       3.104
40        Burundi          BDI   2000       7.057
41     San Marino          SMR   2000         NaN
42    Yemen, Rep.          YEM   2000       6.363
43        Jamaica          JAM   2000       2.603
44       Dominica          DMA   2000         NaN
45  Venezuela, RB          VEN   2000       2.822
46         Cyprus          CYP   2000       1.714
47         Turkey          TUR   2000       2.454
48  Guinea-Bissau          GNB   2000       5.845
49       Colombia          COL   2000       2.640

## Regularizing, Splitting Text Data

Oftentimes, string data contains multiple pieces of data inside it, split with a seperator character.  With it, you can turn a DataFrame from this:

| line |
| :--: |
| hi_1 |
| bye_2|

into this:

| line | msg | num |
| :--: | :--: | :--: |
| hi_1 | hi | 1 |
| bye_2| bye | 2 |

using a single line:

```python
df[['msg', 'num']] = df['line'].str.split('_', expand=True)
```


Let's try it out!

In [9]:
df = pd.DataFrame({
    'counts_XADD': ["1;3;5", "10;2;6"],
    'intensities_JJAKX': ['5_32_654', "10_1_99"],
})
df

  counts_XADD intensities_JJAKX
0       1;3;5          5_32_654
1      10;2;6           10_1_99

First, rename the columns `counts_XADD` and `intensities_JJAKX` to just keep the part of the names before the underscore. For that, we can use the rename function in pandas, which has the following syntax:

```python
df = df.rename(columns={'original_column_name1': 'new_column_name1', 
                        'orignal_column_name2': 'new_column_name2'})
```

In [10]:
df = df.rename(columns={'counts_XADD': 'counts', 'intensities_JJAKX': 'intensities'})
df

   counts intensities
0   1;3;5    5_32_654
1  10;2;6     10_1_99

Split the Counts into Counts_1, Counts_2, and Counts_3

In [11]:
df[['Counts_1', 'Counts_2', 'Counts_3']] = df['counts'].str.split(';', expand = True)
del df['counts']
df

  intensities Counts_1 Counts_2 Counts_3
0    5_32_654        1        3        5
1     10_1_99       10        2        6

Split the Intensities into Intensities_1, Intensities_2, and Intensities_3

In [12]:
df[['Intensities_1', 'Intensities_2', 'Intensities_3']] = df['intensities'].str.split('_', expand = True)
del df['intensities']
df

  Counts_1 Counts_2 Counts_3 Intensities_1 Intensities_2 Intensities_3
0        1        3        5             5            32           654
1       10        2        6            10             1            99

## Concatenating Across CSV Files Using Dask.DataFrame.read_csv()

The Dask DataFrame subpackage makes it possible to work on multiple files at once.  This is especially useful for performance on large datasets, but it also makes managing multiple files in general simple. Just use it like you would Pandas commands, and when you want Dask to make the DataFrame, run the `compute()` method:

To Load and Concatenate many CSV files:

```python
import dask.dataframe as dd
df = dd.read_csv("data/*.csv").compute()
```

Oftentimes, the filename contains metadata data we'd like to include in the analysis.  Dask can add the filename as its own column in the dataframe, for followup text processing:

```python
df = dd.read_csv("data/*.csv", include_path_column=True).compute()
```

In [80]:
%pip install dask

Collecting dask
  Downloading dask-2024.9.0-py3-none-any.whl.metadata (3.7 kB)
Requirement already satisfied: click>=8.1 in c:\users\atle_\anaconda3\envs\intro_python_workshop_prep\lib\site-packages (from dask) (8.1.7)
Collecting cloudpickle>=3.0.0 (from dask)
  Downloading cloudpickle-3.0.0-py3-none-any.whl.metadata (7.0 kB)
Collecting fsspec>=2021.09.0 (from dask)
  Downloading fsspec-2024.9.0-py3-none-any.whl.metadata (11 kB)
Requirement already satisfied: packaging>=20.0 in c:\users\atle_\anaconda3\envs\intro_python_workshop_prep\lib\site-packages (from dask) (24.1)
Collecting partd>=1.4.0 (from dask)
  Downloading partd-1.4.2-py3-none-any.whl.metadata (4.6 kB)
Collecting pyyaml>=5.3.1 (from dask)
  Downloading PyYAML-6.0.2-cp312-cp312-win_amd64.whl.metadata (2.1 kB)
Collecting toolz>=0.10.0 (from dask)
  Downloading toolz-0.12.1-py3-none-any.whl.metadata (5.1 kB)
Requirement already satisfied: colorama in c:\users\atle_\anaconda3\envs\intro_python_workshop_prep\lib\site-packages (from click>=8.1->dask) (0.4.6)
Collecting locket (from partd>=1.4.0->dask)
  Downloading locket-1.0.0-py2.py3-none-any.whl.metadata (2.8 kB)
Downloading dask-2024.9.0-py3-none-any.whl (1.3 MB)
   ---------------------------------------- 0.0/1.3 MB ? eta -:--:--
   -------- ------------------------------- 0.3/1.3 MB ? eta -:--:--
   ---------------- ----------------------- 0.5/1.3 MB 1.9 MB/s eta 0:00:01
   --------------------------------- ------ 1.0/1.3 MB 1.8 MB/s eta 0:00:01
   ---------------------------------------- 1.3/1.3 MB 1.8 MB/s eta 0:00:00
Downloading cloudpickle-3.0.0-py3-none-any.whl (20 kB)
Downloading fsspec-2024.9.0-py3-none-any.whl (179 kB)
Downloading partd-1.4.2-py3-none-any.whl (18 kB)
Downloading PyYAML-6.0.2-cp312-cp312-win_amd64.whl (156 kB)
Downloading toolz-0.12.1-py3-none-any.whl (56 kB)
Downloading locket-1.0.0-py2.py3-none-any.whl (4.4 kB)
Installing collected packages: toolz, pyyaml, locket, fsspec, cloudpickle, partd, dask
Successfully installed cloudpickle-3.0.0 dask-2024.9.0 fsspec-2024.9.0 locket-1.0.0 partd-1.4.2 pyyaml-6.0.2 toolz-0.12.1
Note: you may need to restart the kernel to use updated packages.

### Exercise

Run the following code to create some data files:

In [84]:
from pathlib import Path
Path("peopledata").mkdir(exist_ok=True)
pd.DataFrame({'Name': ['Jackson', 'Josh', 'Jenny'], 'Age': [16, 19, 17]}).to_csv("peopledata/de_1.csv", index=False)
pd.DataFrame({'Name': ['Jess', 'Jon', 'Joe'], 'Age': [21, 16, 23]}, index=[3, 4, 5]).to_csv("peopledata/fr_2.csv", index=False)
pd.DataFrame({'Name': ['Jill', 'Josephine', 'Jack'], 'Age': [5, 10, 61]}).to_csv("peopledata/de_3.csv", index=False)

Read all of them in using Dask DataFrame, concatenate them together, and split the filenames into two columns:  "Country" and "GroupID"

In [88]:
import dask.dataframe as dd

df = dd.read_csv("peopledata/*.csv").compute().reset_index()
del df['index']
df

        Name  Age
0    Jackson   16
1       Josh   19
2      Jenny   17
3       Jill    5
4  Josephine   10
5       Jack   61
6       Jess   21
7        Jon   16
8        Joe   23

## More out-of-core Reshaping Operations: Joins with SQL Queries

Does anyone in your group know some SQL?  You can write to and read from tables in any SQL database using the package sqlalchemy, as well as send custom queries!

| Function | Description |
| :---:    | :----:      |
| `create_engine()` | Describe how sqlalchemy should find and connect to your database |
| `engine.connect()` | Make an open connection to the database (similar to opening a file) |
| `DetaFrame.to_sql("table_name", conn)` | Write to a table in a database you have an open connection to |
| `pd.read_sql_table("table_name", conn)`, | Read from a table in a databae you have an open connection to |
| `pd.read_sql_query("SELECT * FROM table_name", conn)`, | Read from a query in a databae you have an open connection to |

In [89]:
from sqlalchemy import create_engine

In [77]:
%pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.35-cp312-cp312-win_amd64.whl.metadata (9.9 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\atle_\anaconda3\envs\intro_python_workshop_prep\lib\site-packages (from sqlalchemy) (4.12.2)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Downloading greenlet-3.1.0-cp312-cp312-win_amd64.whl.metadata (3.9 kB)
Downloading SQLAlchemy-2.0.35-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ----- ---------------------------------- 0.3/2.1 MB ? eta -:--:--
   --------------- ------------------------ 0.8/2.1 MB 1.9 MB/s eta 0:00:01
   -------------------- ------------------- 1.0/2.1 MB 1.9 MB/s eta 0:00:01
   ------------------------------ --------- 1.6/2.1 MB 1.9 MB/s eta 0:00:01
   ----------------------------------- ---- 1.8/2.1 MB 1.8 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 1.8 MB/s eta 0:00:00
Downloading greenlet-3.1.0-cp312-cp312-win_amd64.whl (294 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.1.0 sqlalchemy-2.0.35
Note: you may need to restart the kernel to use updated packages.

### Create and Population the Database

In [90]:

with create_engine("sqlite:///people.db").connect() as conn:
    pd.DataFrame({'Name': ['Paul', 'Arash', 'Jenny'], 'Age': [16, 19, 17]}).to_sql("ages", conn, index=False)
    pd.DataFrame({'Name': ['Arash', 'Paul', 'Sara'], 'Weight': [32, 15, 37]}).to_sql("weights", conn, index=False)
    pd.DataFrame({'Name': ['Amy', 'Paul', 'Sara'], 'Height': [170, 190, 143]}).to_sql("heights", conn)

### Examples: Read from the Database

In [92]:
with create_engine("sqlite:///people.db").connect() as conn:
    df = pd.read_sql_table("ages", conn)
df

    Name  Age
0   Paul   16
1  Arash   19
2  Jenny   17

In [93]:
query = """
SELECT Age FROM ages
"""
with create_engine("sqlite:///people.db").connect() as conn:
    df = pd.read_sql_query(query, conn)
df

   Age
0   16
1   19
2   17

### Optional Exercise

What kinds of queries can we make on this data?

In [94]:
query = """
SELECT Weight FROM weights
"""
with create_engine("sqlite:///people.db").connect() as conn:
    df = pd.read_sql_query(query, conn)
df

   Weight
0      32
1      15
2      37

In [95]:
query = """
SELECT Height FROM heights
"""

with create_engine("sqlite:///people.db").connect() as conn:
    df = pd.read_sql_query(query, conn)
df

   Height
0     170
1     190
2     143

In [97]:
query = """
SELECT Name from heights
"""

with create_engine("sqlite:///people.db").connect() as conn:
    df = pd.read_sql_query(query, conn)

df

   Name
0   Amy
1  Paul
2  Sara